<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 流年 <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 应用公共文件
// 返回Code代码
function showReturnCode($code = '', $msg = '') {
    $CodeData =  [
        //操作信息 1000
        '1001' => '操作成功',
        '1002' => '操作失败',
        '1005' => '密码错误',
        '1006' => '注册成功',
        '1007' => '注册失败',
        '1008' => '上传成功',
        '1009' => '上传失败',
        '1018' => '取消成功',
        '1019' => '取消失败',
        '1020' => '选择成功',
        //请求信息 2000
        '2001' => '参数错误',
        '2002' => '请先登录',
        '2003' => '授权不符',
        '2004' => '更新成功',
        '2005' => '更新失败',
        '2006' => '非法数据,重新登录',
        //判断信息 4000
        '4000' => '账户已注销,请重新注册',
        '4002' => '账号被禁用,请重新注册',
        '4003' => '操作失败',
        '4004' => '数据不存在',
        '4005' => '手机号已注册',
        '4006' => '操作成功',
        //短信信息 3000
        '3000' => '发送成功',
        '3001' => '发送失败',
        '3002' => '短信已发送,请勿重复点击',
        '3003' => '验证码错误',
        //登录判断
        '5000' => '登录成功',
        '5001' => '登录失败',
        '5002' => '用户名已存在',
        '5004' => '退出成功',
        '5005' => '登录超时',
    ];
    if (!empty($msg)){
        return  $msg;
    }elseif(!empty($code) && isset($CodeData[$code])){
        return $CodeData[$code];
    }else{
        return  "未定义消息";
    }
}